OpenFOAM-6-cantera-openmpi/tutorials/incompressible/pimpleFoam/RAS/oscillatingInletACMI2D/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // Get both sides of ami
    // ~~~~~~~~~~~~~~~~~~~~~

    // Create faceZone for patch couple1
    {
        name    couple1FaceSet;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            name    couple1;
        }
    }
    {
        name    couple1Faces;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet couple1FaceSet;
        }
    }

    // Create faceZone for patch couple2
    {
        name    couple2FaceSet;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            name    couple2;
        }
    }
    {
        name    couple2Faces;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet couple2FaceSet;
        }
    }

    // Create cellZone for moving cells in inlet channel
    {
        name    inletChannelCellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box     (-100 -100 -100) (1.0001 100 100);
        }
    }
    {
        name    inletChannel;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set     inletChannelCellSet;
        }
    }
);

// ************************************************************************* //
