OpenFOAM-6-cantera-openmpi/tutorials/incompressible/pimpleFoam/RAS/oscillatingInletACMI2D/Allrun-parallel
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

./Allmesh

runApplication decomposePar

runParallel $(getApplication)

runApplication reconstructPar
